code/OpenFoam/steadyState/system/createPatchDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;
patches
(
    {
        // Name of new patch
        name allSolids;
        // Type of new patch
        patchInfo
        {
           type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;


        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches ("sphere.*"
        "xpositive"
        "ypositive"
        "xnegative"
        "ynegative");
    }


);
