code/OpenFoam/steadyState/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10000;
        startFace       2970000;
    }
    outlet
    {
        type            patch;
        nFaces          10000;
        startFace       2980000;
    }
    xpositive
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10000;
        startFace       2990000;
    }
    xnegative
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10000;
        startFace       3000000;
    }
    ypositive
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10000;
        startFace       3010000;
    }
    ynegative
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10000;
        startFace       3020000;
    }
)

// ************************************************************************* //
