code/OpenFoam/steadyState/0.orig/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

"procBoundary.*"
{
    type            processor;
    value           uniform (0 0 0);
}

    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.99710e-04;
        rhoInlet        0.9971;
        extrapolateProfile no;
        value           uniform (0 0 0);
    }

    outlet
    {
		type            zeroGradient;
    }

    xpositive
    {
        type            noSlip;
    }

    xnegative
    {
        type            noSlip;
    }

    ypositive
    {
        type            noSlip;
    }

    ynegative
    {
        type            noSlip;
    }

    "sphere.*"
    {
        type            noSlip;
    }

}


// ************************************************************************* //
