code/OpenFoam/steadyState/0.orig/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

"procBoundary.*"
{
    type            processor;
    value           uniform 0;
}

    inlet
    {
	 type            fixedFluxPressure;
    }

    outlet
    {
	 type            fixedValue;
     value           uniform 0;
    }

    xpositive
    {
        type            zeroGradient;
    }

    xnegative
    {
        type            zeroGradient;
    }

    ypositive
    {
        type            zeroGradient;
    }

    ynegative
    {
        type            zeroGradient;
    }

    "sphere.*"
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
