code/OpenFoam/steadyState/system/post_process/Zone1_histogram
HistogramUxZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           Ux;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramUyZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           Uy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramUzZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           Uz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}



HistogramvixZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           vix;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramviyZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           viy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramvizZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           viz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}


HistogramuixZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           uix;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramuiyZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           uiy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramuizZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           uiz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}



Histogramui_massZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           ui_massx;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramui_massyZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           ui_massy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramui_masszZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           ui_massz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}


Histogramv_curlxZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           v_curlx;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramv_curlyZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           v_curly;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramv_curlzZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           v_curlz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramw_AZone1
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone1;
  nBins           $bins;
  field           m_A;
  setFormat       gnuplot;
  max             1;
}
