code/OpenFoam/steadyState/system/post_process/Zone2_histogram
HistogramUxZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           Ux;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramUyZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           Uy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramUzZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           Uz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}



HistogramvixZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           vix;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramviyZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           viy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramvizZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           viz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}


HistogramuixZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           uix;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramuiyZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           uiy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramuizZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           uiz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}



Histogramui_massZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           ui_massx;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramui_massyZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           ui_massy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramui_masszZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           ui_massz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}


Histogramv_curlxZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           v_curlx;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramv_curlyZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           v_curly;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramv_curlzZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           v_curlz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramw_AZone2
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone2;
  nBins           $bins;
  field           m_A;
  setFormat       gnuplot;
  max             1;
}
