code/OpenFoam/steadyState/system/post_process/Zone3_histogram
HistogramUxZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           Ux;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramUyZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           Uy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramUzZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           Uz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}



HistogramvixZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           vix;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramviyZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           viy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramvizZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           viz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}


HistogramuixZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           uix;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramuiyZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           uiy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramuizZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           uiz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}



Histogramui_massZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           ui_massx;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramui_massyZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           ui_massy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramui_masszZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           ui_massz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}


Histogramv_curlxZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           v_curlx;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramv_curlyZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           v_curly;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramv_curlzZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           v_curlz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramw_AZone3
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone3;
  nBins           $bins;
  field           m_A;
  setFormat       gnuplot;
  max             1;
}
