code/OpenFoam/steadyState/system/post_process/Zone6_average
fieldAverageZone6
{
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");
    log             true;
    writeControl    writeTime;
    writeFields     false;
    regionType    	cellZone;
    name 	        	Zone6;
    operation       volIntegrate;
    fields
    (
      p
      rho
      v_macro
      vi_macro
      w_macro
      act_macro
    );
}
