code/OpenFoam/steadyState/system/post_process/Zone7_histogram
HistogramUxZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           Ux;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramUyZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           Uy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramUzZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           Uz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}



HistogramvixZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           vix;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramviyZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           viy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramvizZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           viz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}


HistogramuixZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           uix;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramuiyZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           uiy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

HistogramuizZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           uiz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}



Histogramui_massZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           ui_massx;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramui_massyZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           ui_massy;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramui_masszZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           ui_massz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}


Histogramv_curlxZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           v_curlx;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramv_curlyZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           v_curly;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramv_curlzZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           v_curlz;
  setFormat       gnuplot;
  min             1.e-8;
  max             1.e-1;
}

Histogramw_AZone7
{
  type            histogram;
  libs            ("libfieldFunctionObjects.so");
  writeControl    writeTime;
  writeFields     false;
  regionType    	cellZone;
  name 	        	Zone7;
  nBins           $bins;
  field           m_A;
  setFormat       gnuplot;
  max             1;
}
